# =============== Input ===============
cask "google-japanese-ime"

# =============== Window Management ===============
cask "divvy"

# =============== Browser ===============
cask "brave-browser"

# =============== Font ===============
cask "font-moralerspace-hw-jpdoc"

# =============== Shell & Terminal ===============
brew "fish"
cask "ghostty"

# =============== AI Tools ===============
cask "claude-code"
cask "codex"

# =============== Doom Emacs ===============
tap "d12frosted/emacs-plus"
cask "d12frosted/emacs-plus/emacs-plus-app" # v30.2 (as of 2026/01/21)
# ----- dependencies -----
brew "git"
brew "ripgrep"
brew "coreutils"
brew "fd"
# ---- required by "doom doctor" -----
brew "fontconfig"
brew "markdown"
brew "shellcheck"
brew "aspell"

# =============== Version Management ===============
brew "mise"

# =============== Python ===============
brew "uv"

# =============== Core CLI ===============
brew "gh"
brew "jq"

# =============== Dev Utilities ===============
brew "bat" # cat の代替
brew "eza" # ls の代替
brew "git-delta" # diff-highlight の代替
cask "orbstack"
brew "stow" # config の配置に使用
