cask "google-japanese-ime"

cask "ghostty"

cask "claude-code"
cask "codex"

cask "obsidian"

brew "gh"
brew "jq"

brew "fish"

tap "d12frosted/emacs-plus"
# v30.2(2026/01/21 時点)
cask "d12frosted/emacs-plus/emacs-plus-app"

# Doom
brew "git"
brew "ripgrep"
brew "coreutils"
brew "fd"
## doom doctor
brew "fontconfig"
brew "markdown"
brew "shellcheck"
brew "aspell"

brew "pyenv"
brew "pyenv-virtualenv"
# python の推奨ビルド環境(pyenv v2.6.13 時点)
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz"
brew "tcl-tk@8"
brew "libb2"
brew "zstd"
brew "zlib"
brew "pkgconfig"

brew "nodenv"
brew "node-build"

brew "stow"
brew "eza" # ls の代替
brew "git-delta" # diff-highlight の代替
brew "bat" # cat の代替

cask "divvy"
cask "brave-browser"
