cask "google-japanese-ime"

cask "visual-studio-code"
# 拡張機能
vscode "ms-ceintl.vscode-language-pack-ja"

cask "ghostty"

brew "fish"

tap "railwaycat/emacsmacport"
# Cask だとオプションを指定出来ない
brew "railwaycat/emacsmacport/emacs-mac@29", args: ["with-modules", "with-native-compilation"]

# Doom
brew "git"
brew "ripgrep"
brew "coreutils"
brew "fd"
## doom doctor
brew "fontconfig"
brew "markdown"
brew "shellcheck"
brew "aspell"

brew "pyenv"
brew "pyenv-virtualenv"
# python の推奨ビルド環境(pyenv v2.6.13 時点)
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz"
brew "tcl-tk@8"
brew "libb2"
brew "zstd"
brew "zlib"
brew "pkgconfig"

brew "stow"
# ls の代替
brew "eza"

cask "divvy"
cask "brave-browser"
